#define _CRT_SECURE_NO_WARNINGS 1

#include <stdio.h>



///@Time    :

///@Problem : 打印菱形
/// 
///    键盘读入一个字符，然后在屏幕上显示一个用这个字符填充的对角线长5个字符，倾斜放置的菱形。                                                                   
///                                                                            
///————————————————————————————————————————————————————————————————————————————            
///@Codeing :
///                                                                           
///       打印空格再打印字符，打印上部分再打印下部分                                                                                                                                                 
///****************************************************************************          

//void printLingxk(char ch,int n)//6
//{
//    int i = 0;
//    int j = 0;
//    for (i = 1; i <= n; i++)//遍历上部分，一共n行
//    {
//        for (j = 0; j < n - i; j++)
//        {
//            putchar(' ');
//        }
//        for (j = 0; j < 2 * i - 1; j++)//每行打印奇数个字符1 3 5 7.....
//        {
//            putchar(ch);
//        }
//        putchar('\n');
//    }
//    for (i = 1; i < n; i++)//下部分比上部分少一行
//    {
//        for (j = 0; j < i; j++)
//        {
//            putchar(' ');
//        }
//        for (j = 0; j < 2 * n - 1 - 2 * i; j++)//第i行打印的字符都比最大长度少2*i个
//        {
//            putchar(ch);
//        }
//        putchar('\n');
//    }
//}
//
//int main()
//{
//    char ch = 0;
//    int n = 1;
//    while (n)
//    {
//        puts("请输入(字符 上部分行数):>>");
//        scanf("%c %d",&ch, &n);
//        printLingxk(ch, n);
//    }
//    return 0;
//}

///————————————————————————————————————————————————————————————————————————————  



///@Time    :

///@Problem : scanf()
///                                                                           
///                                                                            
///————————————————————————————————————————————————————————————————————————————            
///@Codeing :
///                                                                           
///                                                                                                                                                        
///****************************************************************************          

//读入后不赋予相应的变量，即跳过该输入值
//int main()
//{
//	int a;
//	int b;
//	scanf("%d %*d %d", &a, &b);
//	printf("%d,%d", a, b);
//	return 0;
//}










///————————————————————————————————————————————————————————————————————————————  


