#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>


//指针数组：
// 
//模拟二维数组
//0.整型变量的地址
//1.整形数组的地址
//2.字符数组的地址
//3.指针数组的地址 
//


//int main()
//{
//	int arr1[] = { 1,2,3,4,5 };
//	int arr2[] = { 2,3,4,5,6 };
//	int arr3[] = { 3,4,5,6,7 };
//	        //int*  int*  int*
//	int* arr[] = { arr1, arr2, arr3 };
//	int i = 0;
//	for (i = 0; i < 3; i++)
//	{
//		int j = 0;
//		for (j = 0; j < 5; j++)
//		{
//			//printf("%d ", arr[i][j]);
//			printf("%d ", *((*arr + i) + j));
//		}
//		printf("\n");
//	}
//	return 0;
//}


//数组指针
// 
//0.二维数组传参时作为形参
//1.

//void print(int (*p)[5], int r, int c)
//{
//	int i = 0;
//	for (i = 0; i < 3; i++)
//	{
//		int j = 0;
//		for (j = 0; j < 5; j++)
//		{
//			//printf("%d ", p[i][j]);
//			printf("%d ", *((*(p + i) + j)));
//		}
//		printf("\n");
//	}
//}
//
//int main()
//{
//	int arr[3][5] = { {1,2,3,4,5},{2,3,4,5,6},{3,4,5,6,7} };
//	print(arr, 3, 5);
//
//	return 0;
//}


//指针作为形参，那么它可以接收的类型有哪些？

//一维数组传参，形参可以是： 
// 0.数组：一维数组，指针数组
// 1.指针：一级指针，二级指针

//二维数组传参，形参可以是：
// 0.二维数组（列不可省略）
// 1.数组指针（列不可省略） 
//

//一级指针作为形参，可接收的类型：
// 0.一维数组名
// 1.整型变量取地址
// 2.整型指针

//二级指针作为形参，可接收的类型：
// 0.一维数组名
// 1.一级指针取地址
// 2.二级指针







