#define _CRT_SECURE_NO_WARNINGS 1

#include <stdio.h>





/// @Problem   :    预处理     
///————————————————————————————————————————————————————————————————————————————            
/// @Solution  : 
/// 一：预定义符号
/// __FILE__	进行编译的源文件
/// __LINE__	文件当前的行号
/// __DATE__	文件被编译的日期
/// __TIME__	文件被编译的时间
/// __STDC__	如果编译器遵循ANSIC，其值为1，否则未定义
/// __FUNCTION__正编译的函数


/// 三: 预处理操作符  
/// 
/// 


/// @Codeing    :      
///**********************************Start*************************************          

//预定义符号

//int main()
//{
//	printf("%s\n", __FILE__);
//	printf("%d\n", __LINE__);
//	printf("%s\n", __DATE__);
//	printf("%s\n", __TIME__);
//	printf("%s\n", __FUNCTION__);
//	//printf("%d\n", __STDC__);//当前使用是的VS2022不遵循ANSI C
//	return 0;
//}


//#define forever for(;;)//宏定义，一个死循环


//printf("hello" " world\n");//printf()函数中参数可以是多个连续的字符串


//使用#，把一个宏参数变成对应的字符串

//#define PRINT(n, format)   printf("the value of "#n" is "format"\n", n)
//
//int main()
//{
//	int a = 10;
//	PRINT(a, "%d");
//	//printf("the value of ""a"" is ""%d""\n", a);
//	return 0;
//}

//##可以把位于它两边的符号合成一个符号

//#define CAT(v, n) v##n
//
//int main()
//{
//	int value10 = 100;
//	printf("%d\n", CAT(value, 10));
//	printf("%d\n", value10);
//
//	return 0;
//}


///**********************************End***************************************



/// @Problem   :       定义宏  
///————————————————————————————————————————————————————————————————————————————            
/// @Solution  : 
/// 一：定义宏
/// 允许定义宏的名字有参数，并且参数可以替换到文本中
/// 定义宏，不能出现递归，不能嵌套定义。

/// 二：
/// 宏的副作用:a++,b++   宏在多处位置替换，使运算不好预测 
/// 定义宏，可以传类型作参数
/// 五.#undef    可以移除一个宏
/// 
///———————————————————————————————————————————————————————————————————————————— 



/// @Problem   :        #与## 
///————————————————————————————————————————————————————————————————————————————            
/// @Solution  : 
/// 一：
/// printf("%#o,%#x");十进制数100，输出是八进制数0144，十六进制数0x64
/// 使用#，把一个宏参数变成对应的字符串
/// ##可以把位于它两边的符号合成一个符号。
///  
///———————————————————————————————————————————————————————————————————————————— 





/// @Problem   :         条件编译
///————————————————————————————————————————————————————————————————————————————            
/// @Solution  : 
/// 一：
/// 0. #if	常量表达式	#elif 常量表达式		#endif
/// 1. #ifdef(#ifndef)	定义宏名		#endif

/// 二：防止头文件多次包含
/// 0. 
/// 1. 

/// @Codeing    :  
///**********************************Start*************************************          






///**********************************End***************************************



